//=============================================================================
// ファイル: model.h
//=============================================================================
// モデルの設定・描画を制御
//=============================================================================

#ifndef __MODEL_H__
#define __MODEL_H__

// ヘッダファイルのインクルード
#include "animator.h"
#include "controller.h"

// フレーム番号の最大値
int max_frame_count = 500;

// Modelクラスの定義（ModelerViewクラスを継承）
class Model : public ModelerView {
  private:
    // 〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜
    // 第3週課題
    //---------------------------------------------------------------------

    // フレーム番号
    int frame_count;

    //-------------------------------------------------------------------------
    // 制御変数
    //-------------------------------------------------------------------------

    // 〜〜〜変数を追加〜〜〜

    // 〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜

  public:
    // コンストラクタ（スーパークラスのコンストラクタを呼び出す）
    Model(int x, int y, int w, int h, char *label) : ModelerView(x, y, w, h, label) {
        // 〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜
        // 第3週課題
        //---------------------------------------------------------------------

        // フレーム番号の初期化
        frame_count = 0;

        //---------------------------------------------------------------------
        // 初期化
        //---------------------------------------------------------------------

        // 〜〜〜変数を初期化〜〜〜

        // 〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜
    }

    // 〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜
    // 第3週課題
    //---------------------------------------------------------------------

    // 自動アニメーションの設定
    void SetAutomaticAnimation() {
        //-----------------------------------------------------------------
        // アニメーション
        //-----------------------------------------------------------------

        // 〜〜〜プログラムを記述〜〜〜

        //-----------------------------------------------------------------
    }

    // 手動アニメーションの設定
    void SetManualAnimation() {
        //-----------------------------------------------------------------
        // アニメーション
        //-----------------------------------------------------------------

        // 〜〜〜プログラムを記述〜〜〜

        //-----------------------------------------------------------------
    }

    // 〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜

    // 描画の前処理
    void BeginPaint() {
        // 半透明処理を有効化
        glEnable(GL_BLEND);
        // 混合方法の指定
        glBlendFunc(GL_SRC_ALPHA, GL_ONE_MINUS_SRC_ALPHA);
    }

    // 描画の後処理
    void EndPaint() {
        // 半透明処理を無効化
        glDisable(GL_BLEND);
    }

    // オブジェクトの描画
    void draw() {
        // 〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜
        // 第3週課題
        //---------------------------------------------------------------------
        //  自動アニメーションの処理
        if (IsAutomaticAnimation() && frame_count < max_frame_count) {
            // フレーム番号の更新
            SetSliderValue(FRAME_CONTROLS, ++frame_count);
            // 自動アニメーション
            SetAutomaticAnimation();
        }
        // 手動アニメーションの処理
        else {
            // フレーム番号を取得
            frame_count = (int)GetSliderValue(FRAME_CONTROLS);
            // 手動アニメーション
            SetManualAnimation();
        }
        // 〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜〜

        // スーパークラスの描画メソッドをコール（必須）
        ModelerView::draw();

        // 描画開始
        BeginPaint();

        //---------------------------------------------------------------------
        // オブジェクトを描画
        //---------------------------------------------------------------------

        // 色を設定
        setAmbientColor(0.5f, 0.5f, 0.5f);
        setSpecularColor(1.0f, 1.0f, 1.0f);
        setShininess(20.0f);

        // 床を描写
        glPushMatrix();
        setDiffuseColor(0.5f, 0.3f, 0.0f, 1.0f);
        glTranslated(-5, -5, -5);
        drawBox(10, 0.2, 10);
        glPopMatrix();

        // スライダの値に従って，x, y, z 軸方向に平行移動
        glTranslated(GetSliderValue(X_POSITION), 0.0f, 0.0f);
        glTranslated(0.0f, GetSliderValue(Y_POSITION), 0.0f);
        glTranslated(0.0f, 0.0f, GetSliderValue(Z_POSITION));

        // 図形を描画
        setDiffuseColor(0.0f, 0.0f, 0.5f, 1.0f);
        drawSphere(2.0f);

        //---------------------------------------------------------------------

        // 描画終了
        EndPaint();
    }
};

// __MODEL_H__
#endif
